export default {
  mobile: /^1(\d){10}$/,    // 验证手机号
  landline: /^0\d{2,3}\-?\d{7,8}$/,    // 固化校验
  notTrim: /^[^ ]+$/,    // 不包含空格的字符串
  money: /((^[1-9]\d*)|^0)(\.\d{0,2}){0,1}$/,    // 金额
  idCard: /(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}[0-9Xx]$)/,    // 身份证号码
  url: /http[s]{0,1}:\/\/([\w.]+\/?)\S*/,    // url校验
  mailbox: /^[A-Za-z0-9\u4e00-\u9fa5]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,    // 邮箱校验
  minNum:/^([01](\.0+)?|0\.([1-9]|[0-9][1-9]))$/, // 大于等于0小于等于1，最多保留两位小数
  creditNo: /[^_IOZSVa-z\W]{2}\d{6}[^_IOZSVa-z\W]{10}$/,  // 统一社会信用代码
}
